In [2]:
import numpy as np
import pandas as pd

In [3]:
grades = {"Emir":50, "James":60, "Lars":30}

In [4]:
pd.Series(grades)

Emir     50
James    60
Lars     30
dtype: int64

In [5]:
names = ["Atil", "James", "Lars"]
grades = [50, 60, 30]

In [6]:
pd.Series(names)

0     Atil
1    James
2     Lars
dtype: object

In [7]:
pd.Series(grades)

0    50
1    60
2    30
dtype: int64

In [8]:
pd.Series(grades, names)

Atil     50
James    60
Lars     30
dtype: int64

In [9]:
pd.Series(data=grades, index=names)

Atil     50
James    60
Lars     30
dtype: int64

In [10]:
# with numpy

In [11]:
numpy_array = np.array([50, 40, 30, 20])
numpy_array

array([50, 40, 30, 20])

In [12]:
pd.Series(numpy_array)

0    50
1    40
2    30
3    20
dtype: int64

In [13]:
# arithmetic

In [14]:
contest_result1 = pd.Series(data=[10, 5, 100], index=["Atil", "Emir", "James"])
contest_result2 = pd.Series(data=[20, 50, 10], index=["Atil", "Emir", "James"])

In [15]:
final_result1 = contest_result1 + contest_result2
final_result1

Atil      30
Emir      55
James    110
dtype: int64

In [16]:
final_result2 = contest_result1 * contest_result2
final_result2

Atil      200
Emir      250
James    1000
dtype: int64

In [17]:
different_series1 = pd.Series([10, 5, 3, 1], ["a", "c", "f", "g"])
different_series2 = pd.Series([20, 30, 40, 50], ["a", "b", "c", "d"])

In [18]:
different_series1 + different_series2

a    30.0
b     NaN
c    45.0
d     NaN
f     NaN
g     NaN
dtype: float64

In [20]:
data = np.random.randn(4,3)
data

array([[ 0.51428664, -0.25134775, -0.05093922],
       [-0.12211016, -0.83073679,  0.28301769],
       [ 0.90909244,  0.34972611,  0.41193243],
       [ 0.73437181,  0.08460524,  1.25694074]])

In [22]:
data_frame = pd.DataFrame(data) 
data_frame

          0         1         2
0  0.514287 -0.251348 -0.050939
1 -0.122110 -0.830737  0.283018
2  0.909092  0.349726  0.411932
3  0.734372  0.084605  1.256941

In [23]:
print(type(data_frame))
print(type(data_frame[0]))

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>

In [24]:
new_df = pd.DataFrame(data, index=["Atil", "Zeynep", "Atlas", "Mehmet"], columns=["Salary", "Age", "Seniorty"])
new_df

          Salary       Age  Seniorty
Atil    0.514287 -0.251348 -0.050939
Zeynep -0.122110 -0.830737  0.283018
Atlas   0.909092  0.349726  0.411932
Mehmet  0.734372  0.084605  1.256941

In [25]:
new_df["Age"]

Atil     -0.251348
Zeynep   -0.830737
Atlas     0.349726
Mehmet    0.084605
Name: Age, dtype: float64

In [28]:
new_df[["Age", "Salary"]]

             Age    Salary
Atil   -0.251348  0.514287
Zeynep -0.830737 -0.122110
Atlas   0.349726  0.909092
Mehmet  0.084605  0.734372

In [30]:
new_df.loc["Atlas"]

Salary      0.909092
Age         0.349726
Seniorty    0.411932
Name: Atlas, dtype: float64

In [32]:
new_df.iloc[1]

Salary     -0.122110
Age        -0.830737
Seniorty    0.283018
Name: Zeynep, dtype: float64

In [33]:
new_df.iloc[1]["Age"]

np.float64(-0.8307367944009857)

In [36]:
new_df.iloc[:,-1]

Atil     -0.050939
Zeynep    0.283018
Atlas     0.411932
Mehmet    1.256941
Name: Seniorty, dtype: float64

In [38]:
new_df["Extra"] = 10
new_df

          Salary       Age  Seniorty  Extra
Atil    0.514287 -0.251348 -0.050939     10
Zeynep -0.122110 -0.830737  0.283018     10
Atlas   0.909092  0.349726  0.411932     10
Mehmet  0.734372  0.084605  1.256941     10

In [ ]:
new_df.drop("Extra", axis=1)

          Salary       Age  Seniorty
Atil    0.514287 -0.251348 -0.050939
Zeynep -0.122110 -0.830737  0.283018
Atlas   0.909092  0.349726  0.411932
Mehmet  0.734372  0.084605  1.256941

In [40]:
new_df

          Salary       Age  Seniorty  Extra
Atil    0.514287 -0.251348 -0.050939     10
Zeynep -0.122110 -0.830737  0.283018     10
Atlas   0.909092  0.349726  0.411932     10
Mehmet  0.734372  0.084605  1.256941     10

In [41]:
new_df.drop("Extra", axis=1, inplace=True)

In [42]:
new_df

          Salary       Age  Seniorty
Atil    0.514287 -0.251348 -0.050939
Zeynep -0.122110 -0.830737  0.283018
Atlas   0.909092  0.349726  0.411932
Mehmet  0.734372  0.084605  1.256941

In [43]:
new_df < 0

        Salary    Age  Seniorty
Atil     False   True      True
Zeynep    True   True     False
Atlas    False  False     False
Mehmet   False  False     False

In [44]:
boolean_frame = new_df < 0

In [45]:
new_df[boolean_frame]

         Salary       Age  Seniorty
Atil        NaN -0.251348 -0.050939
Zeynep -0.12211 -0.830737       NaN
Atlas       NaN       NaN       NaN
Mehmet      NaN       NaN       NaN

In [46]:
new_df[new_df["Salary"] > 0]

          Salary       Age  Seniorty
Atil    0.514287 -0.251348 -0.050939
Atlas   0.909092  0.349726  0.411932
Mehmet  0.734372  0.084605  1.256941

In [48]:
reset_frame = new_df.reset_index()
reset_frame

    index    Salary       Age  Seniorty
0    Atil  0.514287 -0.251348 -0.050939
1  Zeynep -0.122110 -0.830737  0.283018
2   Atlas  0.909092  0.349726  0.411932
3  Mehmet  0.734372  0.084605  1.256941

In [49]:
reset_frame.loc[0]

index           Atil
Salary      0.514287
Age        -0.251348
Seniorty   -0.050939
Name: 0, dtype: object

In [50]:
new_indices = ["Ati", "Zey", "Atl", "Meh"]

In [51]:
new_df["NewIndex"] = new_indices
new_df

          Salary       Age  Seniorty NewIndex
Atil    0.514287 -0.251348 -0.050939      Ati
Zeynep -0.122110 -0.830737  0.283018      Zey
Atlas   0.909092  0.349726  0.411932      Atl
Mehmet  0.734372  0.084605  1.256941      Meh

In [53]:
new_df.set_index("NewIndex", inplace=True)
new_df

            Salary       Age  Seniorty
NewIndex
Ati       0.514287 -0.251348 -0.050939
Zey      -0.122110 -0.830737  0.283018
Atl       0.909092  0.349726  0.411932
Meh       0.734372  0.084605  1.256941

In [54]:
# multi index

In [61]:
first_index = ["Simpson", "Simpson", "Simpson", "South Park", "South Park", "South Park"]
inner_index = ["Homer", "Bart", "Marge", "Cartman", "Kenny", "Kyle"]

In [62]:
zipped_index = list(zip(first_index, inner_index))

In [63]:
zipped_index = pd.MultiIndex.from_tuples(zipped_index)
zipped_index

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [64]:
sample_values = np.ones((6,2))

In [65]:
big_df = pd.DataFrame(sample_values, index=zipped_index, columns=["Age", "Salary"])

In [66]:
big_df["Age"]

Simpson     Homer      1.0
            Bart       1.0
            Marge      1.0
South Park  Cartman    1.0
            Kenny      1.0
            Kyle       1.0
Name: Age, dtype: float64

In [67]:
big_df.loc["Simpson"].loc["Homer"]

Age       1.0
Salary    1.0
Name: Homer, dtype: float64